app/views/employees/show.html.erb


    <% if @employee.documents.any? %>
---
SELECT "documents".* FROM "documents" WHERE "documents"."employee_id" = ?  [["employee_id", 1]]
SELECT 1 AS one FROM "documents" WHERE "documents"."employee_id" = ? LIMIT ?  [["employee_id", 1], ["LIMIT", 1]]

        <tbody>
          <% @employee.documents.each do |document| %>
---
SELECT "documents".* FROM "documents" WHERE "documents"."employee_id" = ?  [["employee_id", 1]]