app/views/documents/_form.html.erb

SELECT "employees".* FROM "employees"
---
  <%= form.label :employee_id %>
  <%= form.select :employee_id, Employee.all.map { |employee| [employee.f_name, employee.id] },  prompt: 'Select employee' %>