app/controllers/documents_controller.rb

    def create
      @document = Document.new(document_params)
      if @document.save
---
INSERT INTO "documents" ("name", "type", "employee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "first"], ["type", "checker"], ["employee_id", 1], ["created_at", "2024-05-09 05:55:39.878440"], ["updated_at", "2024-05-09 05:55:39.878440"]]

    def update
      # @employee=Employee.find(params[:id])
      if @document.update(document_params)
---
UPDATE "documents" SET "updated_at" = ? WHERE "documents"."id" = ?  [["updated_at", "2024-05-09 09:25:25.950979"], ["id", 11]]

    def destroy
      # @employee = Employee.find(params[:id])
      @document.destroy
---
DELETE FROM "documents" WHERE "documents"."id" = ?  [["id", 9]]

    def set_document
      @document = Document.find(params[:id])
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]