app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def update
      @employee=Employee.find(params[:id])