app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" ORDER BY "employees"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def index
      @employees = Employee.all

INSERT INTO "employees" ("f_name", "m_name", "surname", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["f_name", "testing 3 "], ["m_name", "testing 3 "], ["surname", "testing 3 "], ["created_at", "2024-05-08 05:53:46.212119"], ["updated_at", "2024-05-08 05:53:46.212119"]]
---
    def create
      @employee = Employee.new(employee_params)
      if @employee.save

UPDATE "employees" SET "f_name" = ?, "m_name" = ?, "surname" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["f_name", "testing"], ["m_name", "testing"], ["surname", "testing"], ["updated_at", "2024-05-08 05:50:37.335899"], ["id", 3]]
---
    def update
      # @employee=Employee.find(params[:id])
      if @employee.update(employee_params)

DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 8]]
---
    def destroy
      # @employee = Employee.find(params[:id])
      @employee.destroy